# Taps (only include necessary ones)
tap "homebrew/bundle"
tap "homebrew/services"

# CLI Tools
brew "git"
brew "wget"
brew "curl"
brew "tree"
brew "jq"
brew "mas"
brew "htop"
brew "tmux"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "exa"

# Development
brew "node"
brew "yarn"
brew "python"
brew "pyenv"
brew "rbenv"
brew "postgresql", restart_service: true
brew "redis", restart_service: true
brew "gh"  # GitHub CLI
brew "duti"  # Set default applications

# Docker and related tools
cask "docker"  # This installs Docker Desktop which includes docker-compose

# Applications
cask "iterm2"
cask "cursor"
cask "google-chrome"
cask "slack"
cask "1password"
cask "raycast"
cask "figma"

# Fonts
cask "font-fira-code"
cask "font-hack-nerd-font" 